#+TITLE: Teste
* teste
 #+begin_src C :include <stdio.h> :results verbatim
int main(){
float a[4]={3.2, 3.9, 3.0, 3};
int i;
for(i=0;i<=3;i++){
    if(a[i]==((int) a[i]))printf("%d\n",(int)a[i]);
    printf("%d\n",((int) a[i])+1);
    }
}
 #+end_src

 #+RESULTS:
 : 4
 : 4
 : 3
 : 4
 : 3
 : 4
